print('Hello world')
# Git — это набор консольных утилит, которые отслеживают и фиксируют изменения в файлах (чаще всего речь идет об исходном коде программ, но вы можете использовать его для любых файлов на ваш вкус). 
# Изначально Git был создан Линусом Торвальдсом при разработке ядра Linux. 
# Однако инструмент так понравился разработчикам, что в последствии, он получил широкое распространение и его стали использовать в других проектах. 
# С его помощью вы можете сравнивать, анализировать, редактировать, сливать изменения и возвращаться назад к последнему сохранению. 
# Этот процесс называется контролем версий.
# Подробнее https://proglib.io/p/git-for-half-an-hour