print('Hello world')

'''Для того, чтобы внести вклад в какой-либо Git-проект, вам необходимо уметь работать с удалёнными репозиториями. 
Удалённые репозитории представляют собой версии вашего проекта, сохранённые в интернете или ещё где-то в сети. 
У вас может быть несколько удалённых репозиториев, каждый из которых может быть доступен для чтения или для чтения-записи. 
Взаимодействие с другими пользователями предполагает управление удалёнными репозиториями, а также отправку и получение данных из них. 
Управление репозиториями включает в себя как умение добавлять новые, так и умение удалять устаревшие репозитории, а также умение управлять 
различными удалёнными ветками, объявлять их отслеживаемыми или нет и так далее. '''