print('Hello world')

1. git clone <repository-url> - клонирование репозитория Git на локальный компьютер.

2. git remote add <name> <repository-url> - добавление удаленного репозитория в локальный репозиторий Git.

3. git fetch <remote> - загрузка изменений из удаленного репозитория в локальный репозиторий Git.

4. git checkout <branch-name> - переключение на указанную ветку.

5. git merge <branch-name> - слияние указанной ветки с текущей веткой.

6. git tag <tag-name> - создание тега для текущего коммита.

7. git push <remote> <branch-name> - отправка изменений на указанную ветку в удаленный репозиторий.

8. git push <remote> <tag-name> - отправка тега в удаленный репозиторий.

9. git pull <remote> <branch-name> - загрузка изменений из указанной ветки в удаленном репозитории и слияние их с текущей веткой.

10. git rev-parse <ref> - получение хэш-кода указанного объекта Git.

11. git show <ref> - отображение информации о указанном объекте Git.
